create table tbl_interview_review (
    id bigint unsigned auto_increment primary key,           # 기본 키
    corporation_id bigint unsigned not null,                 # 기업 외래 키
    member_id bigint unsigned not null,                      # 회원 외래 키
    job_categoryA_id bigint unsigned not null ,              # 직무직업
    interview_date varchar(255) not null,                    # 면접 일자
    interview_method varchar(255),                           # 면접 진행 방식
    interview_tips varchar(255),                             # 면접 TIP 및 특이사항
    interview_passed varchar(255),                           # 합격 여부
    created_date datetime default current_timestamp,
    updated_date datetime default  current_timestamp,
    constraint fk_interview_review_corporation foreign key (corporation_id)  # 기업 외래 키 제약 조건
        references tbl_corporation(id),
    constraint fk_interview_review_member foreign key (member_id)    # 회원 외래 키 제약 조건
        references tbl_member(id),
    constraint fk_interview_review_job_categoryA foreign key (job_categoryA_id)
        references tbl_job_categoryA(id)
    );

select *
from tbl_interview_review;

# 기업명 / 면접 날짜 / 공고 제목 / 작성자 / 전화 번호 / 지원 분야 / 면접 합격 여부
# c.corporation_name / i.interview_date / n.notice_title / m.member_name / m.member_phone / a.apply_type / i.interview_status

# select
#     c.corporation_name,
#     i.interview_date,
#     n.notice_title,
#     m.member_name,
#     m.member_phone,
#     a.apply_type,
#     i.interview_status
# from
#     tbl_interview_review i
#         join
#     tbl_interview i on c.corporation_id = i.id
#         join
#     tbl_notice n on i.notice_id = n.notice_id
#         join
#     tbl_member m on i.member_id = m.member_id
#         join
#     tbl_apply a on i.apply_id = a.apply_id;

select
    c.corporation_name,     -- 기업명
    i.interview_date,       -- 면접 날짜
    n.notice_title,         -- 공고 제목
    m.member_name,          -- 작성자 이름
    m.member_phone,         -- 전화번호
    a.apply_type,           -- 지원 상태
    r.interview_passed      -- 합격 여부
from
    tbl_interview_review r
    join tbl_corporation c on r.corporation_id = c.id
    join tbl_member m on r.member_id = m.id
    join tbl_interview i on r.id = i.id
    join tbl_apply a on i.resume_id = a.resume_id
    join tbl_notice n on a.notice_id = n.id;

INSERT INTO tbl_interview_review (
    corporation_id,
    member_id,
    job_categoryA_id,
    interview_date,
    interview_method,
    interview_tips,
    interview_passed
) VALUES
      (13, 52, 1, '2023-05-19', '대면 면접', '준비 철저히!', '합격'),
      (16, 43, 1, '2023-09-23', '화상 면접', '준비 철저히!', '합격'),
      (11, 20, 1, '2023-02-04', '화상 면접', '웃으며 자신감 있게!', '보류'),
      (1, 36, 1, '2023-03-28', '대면 면접', '웃으며 자신감 있게!', '보류'),
      (45, 48, 1, '2023-02-18', '전화 면접', '웃으며 자신감 있게!', '합격'),
      (22, 44, 1, '2023-01-25', '화상 면접', '자신감 있게!', '보류'),
      (49, 3, 1, '2023-10-05', '화상 면접', '자신감 있게!', '보류'),
      (18, 5, 1, '2023-01-07', '대면 면접', '자신감 있게!', '보류'),
      (6, 53, 1, '2023-12-13', '대면 면접', '준비 철저히!', '합격'),
      (46, 42, 1, '2023-11-15', '전화 면접', '웃으며 자신감 있게!', '불합격'),
      (1, 21, 1, '2023-03-27', '전화 면접', '준비 철저히!', '불합격'),
      (20, 60, 1, '2023-12-02', '전화 면접', '명확하게 답변하기', '보류'),
      (32, 31, 1, '2023-03-05', '전화 면접', '명확하게 답변하기', '불합격'),
      (20, 29, 1, '2023-07-11', '전화 면접', '자신감 있게!', '불합격'),
      (17, 6, 1, '2023-05-20', '화상 면접', '준비 철저히!', '불합격'),
      (23, 25, 1, '2023-09-11', '대면 면접', '웃으며 자신감 있게!', '합격'),
      (43, 37, 1, '2023-08-23', '전화 면접', '웃으며 자신감 있게!', '보류'),
      (48, 9, 1, '2023-09-07', '전화 면접', '자신감 있게!', '보류'),
      (40, 32, 1, '2023-10-15', '대면 면접', '명확하게 답변하기', '합격'),
      (5, 62, 1, '2023-12-12', '전화 면접', '준비 철저히!', '불합격'),
      (37, 10, 1, '2023-11-25', '대면 면접', '웃으며 자신감 있게!', '합격'),
      (29, 53, 1, '2023-04-12', '전화 면접', '명확하게 답변하기', '보류'),
      (32, 45, 1, '2023-03-22', '대면 면접', '명확하게 답변하기', '불합격'),
      (44, 35, 1, '2023-09-09', '전화 면접', '명확하게 답변하기', '보류'),
      (15, 27, 1, '2023-09-27', '화상 면접', '자신감 있게!', '보류'),
      (47, 60, 1, '2023-12-17', '전화 면접', '명확하게 답변하기', '합격'),
      (45, 40, 1, '2023-03-24', '화상 면접', '준비 철저히!', '보류'),
      (16, 52, 1, '2023-05-26', '대면 면접', '명확하게 답변하기', '불합격'),
      (3, 11, 1, '2023-11-24', '화상 면접', '자신감 있게!', '불합격'),
      (5, 40, 1, '2023-04-12', '대면 면접', '준비 철저히!', '합격'),
      (7, 18, 1, '2023-05-25', '전화 면접', '준비 철저히!', '합격'),
      (8, 19, 1, '2023-04-12', '전화 면접', '준비 철저히!', '보류'),
      (27, 40, 1, '2023-08-15', '전화 면접', '자신감 있게!', '보류'),
      (7, 18, 1, '2023-01-25', '화상 면접', '준비 철저히!', '불합격'),
      (37, 7, 1, '2023-03-03', '대면 면접', '준비 철저히!', '불합격'),
      (26, 56, 1, '2023-02-17', '화상 면접', '명확하게 답변하기', '합격'),
      (27, 4, 1, '2023-05-10', '대면 면접', '명확하게 답변하기', '불합격'),
      (9, 44, 1, '2023-02-12', '전화 면접', '명확하게 답변하기', '합격'),
      (38, 34, 1, '2023-04-01', '전화 면접', '자신감 있게!', '보류'),
      (20, 42, 1, '2023-09-15', '대면 면접', '준비 철저히!', '불합격'),
      (7, 9, 1, '2023-04-25', '대면 면접', '명확하게 답변하기', '합격'),
      (14, 46, 1, '2023-11-20', '화상 면접', '명확하게 답변하기', '불합격'),
      (24, 32, 1, '2023-07-20', '전화 면접', '명확하게 답변하기', '보류'),
      (37, 31, 1, '2023-02-03', '화상 면접', '명확하게 답변하기', '합격'),
      (44, 8, 1, '2023-11-15', '화상 면접', '웃으며 자신감 있게!', '불합격'),
      (45, 8, 1, '2023-11-06', '대면 면접', '준비 철저히!', '보류'),
      (15, 19, 1, '2023-09-21', '대면 면접', '준비 철저히!', '불합격'),
      (49, 7, 1, '2023-08-21', '전화 면접', '자신감 있게!', '보류'),
      (33, 60, 1, '2023-12-28', '화상 면접', '준비 철저히!', '보류'),
      (44, 33, 1, '2023-02-24', '화상 면접', '웃으며 자신감 있게!', '보류'),
      (51, 38, 1, '2023-11-28', '전화 면접', '명확하게 답변하기', '합격'),
      (8, 36, 1, '2023-11-05', '화상 면접', '자신감 있게!', '합격'),
      (38, 18, 1, '2023-12-11', '대면 면접', '웃으며 자신감 있게!', '보류'),
      (40, 30, 1, '2023-03-20', '대면 면접', '자신감 있게!', '합격'),
      (15, 53, 1, '2023-08-15', '화상 면접', '명확하게 답변하기', '합격'),
      (45, 9, 1, '2023-09-11', '화상 면접', '준비 철저히!', '합격'),
      (36, 31, 1, '2023-01-02', '전화 면접', '준비 철저히!', '보류'),
      (24, 34, 1, '2023-02-10', '전화 면접', '웃으며 자신감 있게!', '합격'),
      (3, 14, 1, '2023-06-01', '대면 면접', '웃으며 자신감 있게!', '불합격'),
      (13, 41, 1, '2023-07-22', '대면 면접', '준비 철저히!', '합격'),
      (2, 25, 1, '2023-02-04', '전화 면접', '자신감 있게!', '보류'),
      (42, 34, 1, '2023-09-15', '화상 면접', '자신감 있게!', '합격'),
      (39, 38, 1, '2023-05-04', '전화 면접', '웃으며 자신감 있게!', '보류'),
      (21, 52, 1, '2023-05-27', '대면 면접', '명확하게 답변하기', '합격'),
      (16, 43, 1, '2023-06-18', '전화 면접', '자신감 있게!', '보류'),
      (1, 2, 1, '2023-12-24', '화상 면접', '명확하게 답변하기', '보류'),
      (2, 53, 1, '2023-06-03', '화상 면접', '명확하게 답변하기', '보류'),
      (27, 33, 1, '2023-01-26', '전화 면접', '명확하게 답변하기', '합격'),
      (24, 5, 1, '2023-06-23', '화상 면접', '웃으며 자신감 있게!', '합격'),
      (48, 1, 1, '2023-10-15', '화상 면접', '웃으며 자신감 있게!', '보류'),
      (28, 23, 1, '2023-06-16', '대면 면접', '준비 철저히!', '보류'),
      (2, 51, 1, '2023-02-04', '화상 면접', '명확하게 답변하기', '불합격'),
      (40, 55, 1, '2023-10-11', '전화 면접', '준비 철저히!', '보류'),
      (28, 57, 1, '2023-04-24', '전화 면접', '자신감 있게!', '불합격'),
      (27, 61, 1, '2023-07-03', '전화 면접', '준비 철저히!', '합격'),
      (17, 1, 1, '2023-09-12', '화상 면접', '준비 철저히!', '불합격'),
      (21, 24, 1, '2023-03-19', '화상 면접', '준비 철저히!', '불합격'),
      (31, 11, 1, '2023-12-06', '대면 면접', '명확하게 답변하기', '보류'),
      (12, 6, 1, '2023-03-27', '대면 면접', '명확하게 답변하기', '불합격'),
      (15, 47, 1, '2023-03-20', '전화 면접', '자신감 있게!', '불합격'),
      (15, 52, 1, '2023-02-07', '대면 면접', '명확하게 답변하기', '보류'),
      (24, 18, 1, '2023-06-03', '화상 면접', '명확하게 답변하기', '불합격'),
      (21, 60, 1, '2023-05-14', '전화 면접', '웃으며 자신감 있게!', '합격'),
      (30, 61, 1, '2023-07-04', '전화 면접', '웃으며 자신감 있게!', '합격'),
      (23, 9, 1, '2023-02-04', '화상 면접', '명확하게 답변하기', '합격'),
      (6, 39, 1, '2023-04-14', '화상 면접', '웃으며 자신감 있게!', '불합격'),
      (34, 40, 1, '2023-02-18', '전화 면접', '명확하게 답변하기', '합격'),
      (2, 50, 1, '2023-11-27', '전화 면접', '명확하게 답변하기', '불합격'),
      (20, 60, 1, '2023-12-11', '대면 면접', '웃으며 자신감 있게!', '불합격'),
      (3, 46, 1, '2023-09-19', '화상 면접', '명확하게 답변하기', '보류'),
      (46, 59, 1, '2023-07-02', '대면 면접', '명확하게 답변하기', '불합격'),
      (17, 9, 1, '2023-03-04', '화상 면접', '준비 철저히!', '합격'),
      (2, 51, 1, '2023-01-16', '화상 면접', '자신감 있게!', '합격'),
      (45, 8, 1, '2023-01-22', '대면 면접', '웃으며 자신감 있게!', '합격'),
      (45, 17, 1, '2023-09-27', '대면 면접', '명확하게 답변하기', '보류'),
      (49, 40, 1, '2023-04-08', '대면 면접', '명확하게 답변하기', '보류'),
      (15, 43, 1, '2023-12-24', '화상 면접', '웃으며 자신감 있게!', '보류'),
      (6, 54, 1, '2023-01-18', '화상 면접', '자신감 있게!', '불합격'),
      (51, 38, 1, '2023-03-14', '화상 면접', '자신감 있게!', '불합격'),
      (27, 42, 1, '2023-01-22', '대면 면접', '자신감 있게!', '불합격');



